

// Описание пользователя.
// 
// Возвращаемое значение:
//  Структура - Описание пользователя:
// * Имя - Строка - 
// * ДатаРождения - Дата - 
// * Штатный - Булево - 
// * Стаж - Число - 
&НаКлиенте
Функция ОписаниеПользователя()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("ДатаРождения", ТекущаяДата());
	Человек.Вставить("Штатный", Истина);
	Человек.Вставить("Стаж", 10);
	
	Возврат Человек
КонецФункции	

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = "Изменилось количество";
	
	ПересчитатьСумму(ТекДанные, ТекстСообщения);
	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТекстСообщения = "Изменилась цена";
	
	ПересчитатьСумму(ТекДанные, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(СтрокаТовары, Знач СообщениеПользователю) Экспорт
	СтрокаТовары.Сумма = СтрокаТовары.Количество * СтрокаТовары.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (СообщениеПользователю);
	Сообщение.Сообщить();

	Пользователь = ОписаниеПользователя();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Пользователь.Имя);
	Сообщение.Сообщить();
	

КонецПроцедуры

